# Pandas

Pandas is an open source library whih provides high performance, easy-to-use data structures and data analysis tools for the Python programming language.

In [1]:
import pandas as pd 
import numpy as np

In [3]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [4]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  5 non-null      int32
 1   column2  5 non-null      int32
 2   column3  5 non-null      int32
 3   column4  5 non-null      int32
dtypes: int32(4)
memory usage: 280.0+ bytes

In [11]:
# Accessing elements using    1.loc[] and  2.iloc[]

type(df.loc['Row1'])

pandas.core.series.Series

In [17]:
print(type(df.loc[['Row1','Row2','Row3']]))
df.loc[['Row1','Row2','Row3']]

<class 'pandas.core.frame.DataFrame'>

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

In [19]:
df.iloc[0:3,0:2]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9

In [18]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [22]:
df.iloc[1:,3:]

      column4
Row2        7
Row3       11
Row4       15
Row5       19

In [28]:
df.iloc[:,1:].values.shape

(5, 3)

In [29]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [27]:
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [31]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [32]:
df[['column1','column2']]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [33]:
df.describe()

         column1    column2    column3    column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [34]:
df.corr()

         column1  column2  column3  column4
column1      1.0      1.0      1.0      1.0
column2      1.0      1.0      1.0      1.0
column3      1.0      1.0      1.0      1.0
column4      1.0      1.0      1.0      1.0

In [52]:
Test1=pd.to_csv('df')

AttributeError: module 'pandas' has no attribute 'to_csv'

In [53]:
df[df['column1']>4]   # gives all the rows entirely where column1==4  , column4 >2, whatever condition

      column1  column2  column3  column4
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [48]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [54]:
df.to_csv('Test1.csv')